UNF_KlK.КИТ_ДОК/src/Documents/УкладкаВШтабель/УкладкаВШтабель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УкладкаВШтабель</name>
  <registerRecords>AccumulationRegister.ДвижениеПоПроизводству</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваУНФ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>CatalogRef.Ширины</types>
      </type>
    </attributes>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>CatalogRef.Толщины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Несертифицированный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNF_KlK.КИТ_ДОК/src/Enums/ВидыРеквизита/ВидыРеквизита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРеквизита</name>
  <enumValues>
    <name>ПФ</name>
  </enumValues>
  <enumValues>
    <name>ГП</name>
  </enumValues>
</mdclass:Enum>

UNF_KlK.КИТ_ДОК/src/Catalogs/Диаметр/Диаметр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Диаметр</name>
  <attributes>
    <name>Диаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрХарактеристика</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрХарактеристикаДиапозон</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
</mdclass:Catalog>

UNF_KlK.КИТ_ДОК/src/Documents/УкладкаВШтабель/Forms/ФормаДокумента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьТаблицуДиаметров()
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 10;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.037;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 11;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.045;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 12;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.053;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 13;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.062;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 14;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.073;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 15;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.084;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 16;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.095;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 18;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.120;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 20;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.147;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 22;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.178;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 24;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.210;
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 26;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.250;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 28;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.290;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 30;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.330;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 32;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.380;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 34;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.430;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 36;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.480;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 38;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.530;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 40;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.580;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 42;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.640;
	 
	 СтрДиам = ТаблицаДиаметров.Добавить();
	 СтрДиам.Диаметр = 44;
	 СтрДиам.Длина = 4;
	 СтрДиам.Объем = 0.700;
	 
	 
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоПачки()
	СтрПачек = Элементы.ДанныеПачек.ТекущиеДанные;
	Если СтрПачек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    СтрПачек.Количество = СтрПачек.ДлинаПачки*СтрПачек.ШиринаПачки*СтрПачек.ВысотаПачки*СтрПачек.КоэффицентДревесности;
	
КонецПроцедуры

&НаСервере
Функция НайтиДиапозонДиаметр(Диаметр)
	ДимаетрДиапозонПоиска = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диаметры.ДиаметрХарактеристика КАК ДиаметрХарактеристика
		|ИЗ
		|	Справочник.Диаметр КАК Диаметры
		|ГДЕ
		|	Диаметры.Диаметр = &Диаметр";
	
	Запрос.УстановитьПараметр("Диаметр", Диаметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДимаетрДиапозонПоиска = ВыборкаДетальныеЗаписи.ДиаметрХарактеристика; 
	КонецЦикла;
	
	Возврат ДимаетрДиапозонПоиска;
	
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	Для счетчик = ДиаметрНачальный по ДиаметрКонечный Цикл
		Если (Счетчик-Окр(Счетчик))<> 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрЗамеры = Объект.Сырье.Добавить();
		СтрЗамеры.Номенклатура = Номенклатура; 
		//СтрЗамеры.НоменклатураБрак = Брак;
        СтрЗамеры.Диаметр = НайтиДиапозонДиаметр(счетчик);
		СтрЗамеры.Порода = Порода;
		СтрЗамеры.ДиаметрЧисло = счетчик;
		СтрЗамеры.Длина  = Длина;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		
	КонецЕсли; 
	
	ПВХ_Диаметры = константы.СвойствоДляДиаметра.Получить(); 
	ПВХ_Породы = Константы.СвойствоДляПород.Получить(); 
	ПВХ_ПородыПЛ = Константы.СвойствоДляПородПЛ.Получить(); 
	ПВХ_Сорт = Константы.СвойствоДляСортов.Получить(); 
	ВидДляПараметров = Перечисления.ВидыРеквизита.ГП;
    Длина = 4.0;
	СформироватьТаблицуДиаметров(); 
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроцентКорыПриИзменении(Элемент)
	Объект.КоличествоКоры = Объект.Сырье.Итог("Количество")*Объект.ПроцентКоры/100;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПачек
&НаКлиенте
Процедура ДанныеПачекВысотаПачкиПриИзменении(Элемент)
	РассчитатьКоличествоПачки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПачекШиринаПачкиПриИзменении(Элемент)
	РассчитатьКоличествоПачки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПачекДлинаПачкиПриИзменении(Элемент)
	РассчитатьКоличествоПачки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПачекКоэффицентДревесностиПриИзменении(Элемент)
	РассчитатьКоличествоПачки();
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыРучнойУчетКоличествоШтукПриИзменении(Элемент)
	СтрЗамеры = Элементы.Сырье.ТекущиеДанные;
	Если СтрЗамеры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		СтруктураПоискаДиам = Новый Структура;
		СтруктураПоискаДиам.Вставить("Диаметр",СтрЗамеры.ДиаметрЧисло);
		СтруктураПоискаДиам.Вставить("Длина",СтрЗамеры.Длина);
		
		СтрТабДиам = ТаблицаДиаметров.НайтиСтроки(СтруктураПоискаДиам);
		СтрЗамеры.Количество = СтрЗамеры.КоличествоШтук*СтрТабДиам[0].Объем;
	Исключение
    КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыРучнойУчетКоличествоШтукБракПриИзменении(Элемент)
	СтрЗамеры = Элементы.Сырье.ТекущиеДанные;
	Если СтрЗамеры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		СтруктураПоискаДиам = Новый Структура;
		СтруктураПоискаДиам.Вставить("Диаметр",СтрЗамеры.ДиаметрЧисло);
		СтруктураПоискаДиам.Вставить("Длина",СтрЗамеры.Длина);
		
		СтрТабДиам = ТаблицаДиаметров.НайтиСтроки(СтруктураПоискаДиам);
		СтрЗамеры.КоличествоБрак = СтрЗамеры.КоличествоШтукБрак*СтрТабДиам[0].Объем;
	Исключение
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыРучнойУчетДиаметрЧислоПриИзменении(Элемент)
	СтрЗамеры = Элементы.Сырье.ТекущиеДанные;
	Если СтрЗамеры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрЗамеры.Диаметр = НайтиДиапозонДиаметр(СтрЗамеры.ДиаметрЧисло);
	СтрЗамеры.Длина = 4;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыРучнойУчетДлинаПриИзменении(Элемент)
	СтрЗамеры = Элементы.Сырье.ТекущиеДанные;
	Если СтрЗамеры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		СтруктураПоискаДиам = Новый Структура;
		СтруктураПоискаДиам.Вставить("Диаметр",СтрЗамеры.ДиаметрЧисло);
		СтруктураПоискаДиам.Вставить("Длина",СтрЗамеры.Длина);
		
		СтрТабДиам = ТаблицаДиаметров.НайтиСтроки(СтруктураПоискаДиам);
		СтрЗамеры.Количество = СтрЗамеры.КоличествоШтук*СтрТабДиам[0].Объем;
	Исключение
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПоставКоличествоДосокПриИзменении(Элемент)
		СтрПостав = Элементы.Состав.ТекущиеДанные;
	Если СтрПостав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрПостав.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(СтрПостав.КоличествоДосок, СтрПостав.Толщина, СтрПостав.Ширина, СтрПостав.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ПоставДлинаПриИзменении(Элемент)
		СтрПостав = Элементы.Состав.ТекущиеДанные;
	Если СтрПостав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрПостав.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(СтрПостав.КоличествоДосок, СтрПостав.Толщина, СтрПостав.Ширина, СтрПостав.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ПоставШиринаПриИзменении(Элемент)
	СтрПостав = Элементы.Состав.ТекущиеДанные;
	Если СтрПостав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрПостав.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(СтрПостав.КоличествоДосок, СтрПостав.Толщина, СтрПостав.Ширина, СтрПостав.Длина);
КонецПроцедуры


#КонецОбласти
&НаКлиенте
Процедура ПоставТолщинаПриИзменении(Элемент)
	СтрПостав = Элементы.Состав.ТекущиеДанные;
	Если СтрПостав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрПостав.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(СтрПостав.КоличествоДосок, СтрПостав.Толщина, СтрПостав.Ширина, СтрПостав.Длина);

КонецПроцедуры



// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
